{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "norm1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "norm1", "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "reduction2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "reduction2", "inbound_nodes": [[["norm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2", "inbound_nodes": [[["reduction2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "norm2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "norm2", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pool2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pool2", "inbound_nodes": [[["norm2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp1_reduction1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp1_reduction1", "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp1_reduction2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp1_reduction2", "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp1_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "icp1_pool", "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp1_out0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp1_out0", "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp1_out1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp1_out1", "inbound_nodes": [[["icp1_reduction1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp1_out2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp1_out2", "inbound_nodes": [[["icp1_reduction2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp1_out3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp1_out3", "inbound_nodes": [[["icp1_pool", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "icp2_in", "trainable": true, "dtype": "float32", "axis": 3}, "name": "icp2_in", "inbound_nodes": [[["icp1_out0", 0, 0, {}], ["icp1_out1", 0, 0, {}], ["icp1_out2", 0, 0, {}], ["icp1_out3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp2_reduction1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp2_reduction1", "inbound_nodes": [[["icp2_in", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp2_reduction2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp2_reduction2", "inbound_nodes": [[["icp2_in", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp2_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "icp2_pool", "inbound_nodes": [[["icp2_in", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp2_out0", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp2_out0", "inbound_nodes": [[["icp2_in", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp2_out1", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp2_out1", "inbound_nodes": [[["icp2_reduction1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp2_out2", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp2_out2", "inbound_nodes": [[["icp2_reduction2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp2_out3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp2_out3", "inbound_nodes": [[["icp2_pool", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "icp2_out", "trainable": true, "dtype": "float32", "axis": 3}, "name": "icp2_out", "inbound_nodes": [[["icp2_out0", 0, 0, {}], ["icp2_out1", 0, 0, {}], ["icp2_out2", 0, 0, {}], ["icp2_out3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp3_in", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "icp3_in", "inbound_nodes": [[["icp2_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp3_reduction1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp3_reduction1", "inbound_nodes": [[["icp3_in", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp3_reduction2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp3_reduction2", "inbound_nodes": [[["icp3_in", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp3_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "icp3_pool", "inbound_nodes": [[["icp3_in", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp3_out0", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp3_out0", "inbound_nodes": [[["icp3_in", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp3_out1", "trainable": true, "dtype": "float32", "filters": 208, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp3_out1", "inbound_nodes": [[["icp3_reduction1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp3_out2", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp3_out2", "inbound_nodes": [[["icp3_reduction2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp3_out3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp3_out3", "inbound_nodes": [[["icp3_pool", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "icp3_out", "trainable": true, "dtype": "float32", "axis": 3}, "name": "icp3_out", "inbound_nodes": [[["icp3_out0", 0, 0, {}], ["icp3_out1", 0, 0, {}], ["icp3_out2", 0, 0, {}], ["icp3_out3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp4_reduction1", "trainable": true, "dtype": "float32", "filters": 112, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp4_reduction1", "inbound_nodes": [[["icp3_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp4_reduction2", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp4_reduction2", "inbound_nodes": [[["icp3_out", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp4_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "icp4_pool", "inbound_nodes": [[["icp3_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp4_out0", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp4_out0", "inbound_nodes": [[["icp3_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp4_out1", "trainable": true, "dtype": "float32", "filters": 224, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp4_out1", "inbound_nodes": [[["icp4_reduction1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp4_out2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp4_out2", "inbound_nodes": [[["icp4_reduction2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp4_out3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp4_out3", "inbound_nodes": [[["icp4_pool", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "icp4_out", "trainable": true, "dtype": "float32", "axis": 3}, "name": "icp4_out", "inbound_nodes": [[["icp4_out0", 0, 0, {}], ["icp4_out1", 0, 0, {}], ["icp4_out2", 0, 0, {}], ["icp4_out3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp5_reduction1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp5_reduction1", "inbound_nodes": [[["icp4_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp5_reduction2", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp5_reduction2", "inbound_nodes": [[["icp4_out", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp5_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "icp5_pool", "inbound_nodes": [[["icp4_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp5_out0", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp5_out0", "inbound_nodes": [[["icp4_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp5_out1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp5_out1", "inbound_nodes": [[["icp5_reduction1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp5_out2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp5_out2", "inbound_nodes": [[["icp5_reduction2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp5_out3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp5_out3", "inbound_nodes": [[["icp5_pool", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "icp5_out", "trainable": true, "dtype": "float32", "axis": 3}, "name": "icp5_out", "inbound_nodes": [[["icp5_out0", 0, 0, {}], ["icp5_out1", 0, 0, {}], ["icp5_out2", 0, 0, {}], ["icp5_out3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp6_reduction1", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp6_reduction1", "inbound_nodes": [[["icp5_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp6_reduction2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp6_reduction2", "inbound_nodes": [[["icp5_out", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp6_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "icp6_pool", "inbound_nodes": [[["icp5_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp6_out0", "trainable": true, "dtype": "float32", "filters": 112, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp6_out0", "inbound_nodes": [[["icp5_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp6_out1", "trainable": true, "dtype": "float32", "filters": 288, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp6_out1", "inbound_nodes": [[["icp6_reduction1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp6_out2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp6_out2", "inbound_nodes": [[["icp6_reduction2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp6_out3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp6_out3", "inbound_nodes": [[["icp6_pool", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "icp6_out", "trainable": true, "dtype": "float32", "axis": 3}, "name": "icp6_out", "inbound_nodes": [[["icp6_out0", 0, 0, {}], ["icp6_out1", 0, 0, {}], ["icp6_out2", 0, 0, {}], ["icp6_out3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp7_reduction1", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp7_reduction1", "inbound_nodes": [[["icp6_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp7_reduction2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp7_reduction2", "inbound_nodes": [[["icp6_out", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp7_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "icp7_pool", "inbound_nodes": [[["icp6_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp7_out0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp7_out0", "inbound_nodes": [[["icp6_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp7_out1", "trainable": true, "dtype": "float32", "filters": 320, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp7_out1", "inbound_nodes": [[["icp7_reduction1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp7_out2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp7_out2", "inbound_nodes": [[["icp7_reduction2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp7_out3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp7_out3", "inbound_nodes": [[["icp7_pool", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "icp7_out", "trainable": true, "dtype": "float32", "axis": 3}, "name": "icp7_out", "inbound_nodes": [[["icp7_out0", 0, 0, {}], ["icp7_out1", 0, 0, {}], ["icp7_out2", 0, 0, {}], ["icp7_out3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp8_in", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "icp8_in", "inbound_nodes": [[["icp7_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp8_reduction1", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp8_reduction1", "inbound_nodes": [[["icp8_in", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp8_reduction2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp8_reduction2", "inbound_nodes": [[["icp8_in", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp8_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "icp8_pool", "inbound_nodes": [[["icp8_in", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp8_out0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp8_out0", "inbound_nodes": [[["icp8_in", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp8_out1", "trainable": true, "dtype": "float32", "filters": 320, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp8_out1", "inbound_nodes": [[["icp8_reduction1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp8_out2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp8_out2", "inbound_nodes": [[["icp8_reduction2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp8_out3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp8_out3", "inbound_nodes": [[["icp8_pool", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "icp8_out", "trainable": true, "dtype": "float32", "axis": 3}, "name": "icp8_out", "inbound_nodes": [[["icp8_out0", 0, 0, {}], ["icp8_out1", 0, 0, {}], ["icp8_out2", 0, 0, {}], ["icp8_out3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp9_reduction1", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp9_reduction1", "inbound_nodes": [[["icp8_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp9_reduction2", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp9_reduction2", "inbound_nodes": [[["icp8_out", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "icp9_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "icp9_pool", "inbound_nodes": [[["icp8_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp9_out0", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp9_out0", "inbound_nodes": [[["icp8_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp9_out1", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp9_out1", "inbound_nodes": [[["icp9_reduction1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp9_out2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp9_out2", "inbound_nodes": [[["icp9_reduction2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "icp9_out3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "icp9_out3", "inbound_nodes": [[["icp9_pool", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "icp9_out", "trainable": true, "dtype": "float32", "axis": 3}, "name": "icp9_out", "inbound_nodes": [[["icp9_out0", 0, 0, {}], ["icp9_out1", 0, 0, {}], ["icp9_out2", 0, 0, {}], ["icp9_out3", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "cls3_pool", "trainable": true, "dtype": "float32", "pool_size": [7, 7], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "name": "cls3_pool", "inbound_nodes": [[["icp9_out", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["cls3_pool", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "cls3_fc1_pose", "trainable": true, "dtype": "float32", "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cls3_fc1_pose", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["cls3_fc1_pose", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "cls3_fc_pose_xyz", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cls3_fc_pose_xyz", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["cls3_fc_pose_xyz", 0, 0]]}, "name": "model", "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABAAAAAcAAABDAAAAczgAAAB8AFwCfQF9AnQAagF0AKACfAF8AhgAoQFkAWQCZAON\nA30DdACgA3QAoAR8A3QAoAWhAKECoQFTACkETukBAAAAVCkC2gRheGlz2ghrZWVwZGltcykG2gFL\n2gNzdW3aBnNxdWFyZdoEc3FydNoHbWF4aW11bdoHZXBzaWxvbikEWgV2ZWN0c9oBeNoBeVoKc3Vt\nX3NxdWFyZakAcgwAAAD6Ui9ob21lL2xpbmsvUHJvamVjdHMvaW1hZ2UtYmFzZWQtaW5kb29yLWxv\nY2FsaXphdGlvbi9zcmMvc2lhbWVzZV9uZXR3b3JrL3Bvc2VuZXQucHnaEmV1Y2xpZGVhbl9kaXN0\nYW5jZS8AAABzBgAAAAABCAEaAQ==\n", null, null], "function_type": "lambda", "module": "posenet", "output_shape": ["4wEAAAAAAAAAAwAAAAIAAABDAAAAcxQAAAB8AFwCfQF9AnwBZAEZAGQCZgJTACkDTukAAAAA6QEA\nAACpACkD2gZzaGFwZXPaBnNoYXBlMdoGc2hhcGUycgMAAAByAwAAAPpSL2hvbWUvbGluay9Qcm9q\nZWN0cy9pbWFnZS1iYXNlZC1pbmRvb3ItbG9jYWxpemF0aW9uL3NyYy9zaWFtZXNlX25ldHdvcmsv\ncG9zZW5ldC5wedoWZXVjbF9kaXN0X291dHB1dF9zaGFwZTUAAABzBAAAAAABCAE=\n", null, null], "output_shape_type": "lambda", "output_shape_module": "posenet", "arguments": {}}, "name": "lambda", "inbound_nodes": [[["model", 1, 0, {}], ["model", 2, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["lambda", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}